mysql> CREATE DATABASE lab4;
Query OK, 1 row affected (0.00 sec)

mysql> USE lab4;
Database changed
mysql> SET NAMES utf8;
Query OK, 0 rows affected, 1 warning (0.00 sec)

mysql> SET time_zone = '+00:00';
Query OK, 0 rows affected (0.00 sec)

mysql> SET foreign_key_checks = 0;
Query OK, 0 rows affected (0.00 sec)

mysql> SET sql_mode = 'NO_AUTO_VALUE_ON_ZERO';
Query OK, 0 rows affected (0.00 sec)

mysql> 
mysql> DROP TABLE IF EXISTS `cities`;
Query OK, 0 rows affected, 1 warning (0.00 sec)

mysql> CREATE TABLE `cities` (
    ->   `id` int(10) unsigned NOT NULL AUTO_INCREMENT,
    ->   `name` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
    ->   `population` int(10) unsigned DEFAULT NULL,
    ->   `region` varchar(5) COLLATE utf8_unicode_ci DEFAULT NULL,
    ->   PRIMARY KEY (`id`)
    -> ) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;
Query OK, 0 rows affected, 6 warnings (0.01 sec)

mysql> 
mysql> INSERT INTO `cities` (`id`, `name`, `population`, `region`) VALUES
    -> (1,	'Київ',	2888470,	'N'),
    -> (2,	'Харків',	1444540,	'E'),
    -> (3,	'Одеса',	1010000,	'S'),
    -> (4,	'Дніпро',	984423,	'C'),
    -> (5,	'Донецьк',	932562,	'E'),
    -> (6,	'Запоріжжя',	758011,	'E'),
    -> (7,	'Львів',	728545,	'W'),
    -> (8,	'Кривий Ріг',	646748,	'S'),
    -> (9,	'Миколаїв',	494381,	'S'),
    -> (10,	'Маріуполь',	458533,	'S'),
    -> (11,	'Луганськ',	417990,	'E'),
    -> (12,	'Севастополь',	412630,	'S'),
    -> (13,	'Вінниця',	372432,	'W'),
    -> (14,	'Макіївка',	348173,	'E'),
    -> (15,	'Сімферополь',	332608,	'S'),
    -> (16,	'Херсон',	296161,	'S'),
    -> (17,	'Полтава',	294695,	'E'),
    -> (18,	'Чернігів',	294522,	'N'),
    -> (19,	'Черкаси',	284459,	'C'),
    -> (20,	'Суми',	268409,	'E'),
    -> (21,	'Житомир',	268000,	'N'),
    -> (22,	'Хмельницький',	267891,	'W'),
    -> (23,	'Чернівці',	264427,	'W'),
    -> (24,	'Горлівка',	250991,	'E'),
    -> (25,	'Рівне',	249477,	'W'),
    -> (26,	'Кам\'янське',	240477,	'C'),
    -> (27,	'Кропивницький',	232052,	'C'),
    -> (28,	'Івано-Франківськ',	229447,	'W'),
    -> (29,	'Кременчук',	224997,	'C'),
    -> (30,	'Тернопіль',	217950,	'W'),
    -> (31,	'Луцьк',	217082,	'W'),
    -> (32,	'Біла Церква',	211080,	'N'),
    -> (33,	'Краматорськ',	160895,	'E'),
    -> (34,	'Мелітополь',	156719,	'S'),
    -> (35,	'Керч',	147668,	'S'),
    -> (36,	'Сєвєродонецьк',	130000,	'E'),
    -> (37,	'Хрустальний',	124000,	'E'),
    -> (38,	'Нікополь',	119627,	'C'),
    -> (39,	'Бердянськ',	115476,	'S'),
    -> (40,	'Слов\'янськ',	115421,	'E'),
    -> (41,	'Ужгород',	115195,	'W'),
    -> (42,	'Алчевськ',	111360,	'E'),
    -> (43,	'Павлоград',	110144,	'E'),
    -> (44,	'Євпаторія',	106115,	'S'),
    -> (45,	'Лисичанськ',	103459,	'E'),
    -> (46,	'Кам\'янець-Подільський',	101590,	'W'),
    -> (47,	'Бровари',	100374,	'N'),
    -> (48,	'Дрогобич',	98015,	'W'),
    -> (49,	'Кадіївка',	92132,	'E'),
    -> (50,	'Конотоп',	92000,	'E');
Query OK, 50 rows affected (0.00 sec)
Records: 50  Duplicates: 0  Warnings: 0

mysql> SELECT UPPER(name) AS city_name 
    -> FROM cities 
    -> ORDER BY name 
    -> LIMIT 5 OFFSET 5;
+--------------------+
| city_name          |
+--------------------+
| ГОРЛІВКА           |
| ДНІПРО             |
| ДОНЕЦЬК            |
| ДРОГОБИЧ           |
| ЄВПАТОРІЯ          |
+--------------------+
5 rows in set (0.00 sec)

mysql> SELECT name, LENGTH(name) AS name_length 
    -> FROM cities 
    -> WHERE LENGTH(name) NOT IN (8, 9, 10);
+------------------------------------------+-------------+
| name                                     | name_length |
+------------------------------------------+-------------+
| Харків                                   |          12 |
| Дніпро                                   |          12 |
| Донецьк                                  |          14 |
| Запоріжжя                                |          18 |
| Кривий Ріг                               |          19 |
| Миколаїв                                 |          16 |
| Маріуполь                                |          18 |
| Луганськ                                 |          16 |
| Севастополь                              |          22 |
| Вінниця                                  |          14 |
| Макіївка                                 |          16 |
| Сімферополь                              |          22 |
| Херсон                                   |          12 |
| Полтава                                  |          14 |
| Чернігів                                 |          16 |
| Черкаси                                  |          14 |
| Житомир                                  |          14 |
| Хмельницький                             |          24 |
| Чернівці                                 |          16 |
| Горлівка                                 |          16 |
| Кам'янське                               |          19 |
| Кропивницький                            |          26 |
| Івано-Франківськ                         |          31 |
| Кременчук                                |          18 |
| Тернопіль                                |          18 |
| Біла Церква                              |          21 |
| Краматорськ                              |          22 |
| Мелітополь                               |          20 |
| Сєвєродонецьк                            |          26 |
| Хрустальний                              |          22 |
| Нікополь                                 |          16 |
| Бердянськ                                |          18 |
| Слов'янськ                               |          19 |
| Ужгород                                  |          14 |
| Алчевськ                                 |          16 |
| Павлоград                                |          18 |
| Євпаторія                                |          18 |
| Лисичанськ                               |          20 |
| Кам'янець-Подільський                    |          40 |
| Бровари                                  |          14 |
| Дрогобич                                 |          16 |
| Кадіївка                                 |          16 |
| Конотоп                                  |          14 |
+------------------------------------------+-------------+
43 rows in set (0.00 sec)

mysql> SELECT region, SUM(population) AS total_population 
    -> FROM cities 
    -> WHERE region IN ('C', 'S') 
    -> GROUP BY region;
+--------+------------------+
| region | total_population |
+--------+------------------+
| S      |          4177039 |
| C      |          2086035 |
+--------+------------------+
2 rows in set (0.00 sec)

mysql> SELECT AVG(population) AS avg_population 
    -> FROM cities 
    -> WHERE region = 'W';
+----------------+
| avg_population |
+----------------+
|    260186.4545 |
+----------------+
1 row in set (0.00 sec)

mysql> SELECT COUNT(*) AS city_count 
    -> FROM cities 
    -> WHERE region = 'E';
+------------+
| city_count |
+------------+
|         17 |
+------------+
1 row in set (0.00 sec)

mysql> Terminal close -- exit!
